#{{AUTOGENERATED_SCRIPT}}#

proc print_violations_summary {} {
    puts "Fatal   : [get_violation_info -severity fatal]"
    puts "Error   : [get_violation_info -severity error]"
    puts "Warning : [get_violation_info -severity warning]"
    puts "Info    : [get_violation_info -severity info]"
}

proc fail_violation {severity} {
    set count [get_violation_info -severity $severity]
    if {$count} {
        error "Error: count:$count  severity:$severity"
    }
}

proc fail_violations {{severities "warning error fatal"}} {
    foreach severity $severities {
        fail_violation $severity
    }
}

set search_path $include_dirs
if {$enable_liberty} {
    set link_library $link_library
} else {
    waive_violation -app setup -add global_waiver_1 -filter { Tag==COM_OPT010 } -comment {Search path is not needed in pure RTL lint}
}

# Configure VC Static
set_app_var enable_lint true
set_app_var report_all_hdl_errors true
configure_lint_setup -goal lint_rtl

# Include lint config files
set config_list [split $config_files " "]
foreach config $config_list {
    source $config
}

# Include waiver file
set waiver_list [split $waiver_files " "]
foreach waiver $waiver_list {
    source $waiver
}

# Check the design
analyze -format sverilog -vcs "$sources -sverilog"
elaborate $top_module
check_lint

# Generate report
report_violations -verbose -file $report_file -report {sg_moresimple}
waive_violation -tcl -not_applied

print_violations_summary
fail_violations "warning error fatal"
