#{{AUTOGENERATED_SCRIPT}}#

proc exit_on_violation {{ignore_severities ""} {ignore_tags ""}} {
    set violation_tags [get_violation_tags]
    foreach tag $violation_tags {
    	set info [get_tag_info $tag]
        puts "TAG: $info"
        if {$tag in $ignore_tags} {
            puts "Waived: Tag is in ignored tags"
            continue
        }
        set severity [lindex $info 1]
        if {$severity in $ignore_severities} {
            puts "Waived: $severity is in ignored severities"
            continue
        }
        # Tag example:
        # "Lint warning LANGUAGE_CHECK CODING enabled 0 0 1"
        # Index 5: Total number of violations
        # Index 6: Number of waived violations
        set num_viols [lindex $info 5]
        set num_waived [lindex $info 6]
        puts "Violations/Waived:$num_viols/$num_waived"
        if {$num_viols == $num_waived} {
            continue
        }
        error "Violation found (tag: $tag, severity: $severity)"
    }
}

set search_path $include_dirs
if {$enable_liberty} {
    set link_library $link_library
} else {
    waive_violation -app setup -add global_waiver_1 -filter { Tag==COM_OPT010 } -comment {Search path is not needed in pure RTL lint}
}

# Configure VC Static
set_app_var enable_lint true
set_app_var report_all_hdl_errors true
configure_lint_setup -goal lint_rtl

# Include waiver file
set waiver_list [split $waiver_files " "]
foreach waiver $waiver_list {
    source $waiver
}

# Check the design
analyze -format sverilog -vcs "$sources -sverilog"
elaborate $top_module
check_lint

# Generate report
report_violations -verbose -file $report_file -report {sg_moresimple}
exit_on_violation "info"
