#{{AUTOGENERATED_SCRIPT}}#

#{{SDC_AUTOGENERATED_VARS}}#

proc print_violations_summary {severities} {
    foreach severity $severities {
        puts "$severity : [get_violation_info -severity $severity]"
    }
}

proc fail_violation {severity} {
    set count [get_violation_info -severity $severity]
    if {$count} {
        error "Error: count:$count  severity:$severity"
    }
}

proc fail_violations {{severities "warning error fatal"}} {
    foreach severity $severities {
        fail_violation $severity
    }
}

set search_path $include_dirs
analyze -format sverilog -vcs "$sources -sverilog $vcs_opts"
elaborate $top_module
set_app_var enable_rdc true

read_sdc $sdc_file

# Check RDC
check_rdc
report_rdc -verbose -file $report_file
print_violations_summary $all_severities
fail_violations $failing_severities
